Repository: KDE/libksieve
Catalog: po/*/libksieve6.po
Languages: ar, he

source: Cannot use TLS since the underlying Qt library does not support it.
ar: لا يمكن استخدام TLS لأن مكتبة Qt الأساسية لا تدعمه.
he: לא ניתן להשתמש ב־TLS כיוון שספריית ה־Qt שתחתיו לא תומכת בו.

source: TLS encryption was requested, but your Sieve server does not advertise TLS in its capabilities. You can choose to try to initiate TLS negotiations nonetheless, or cancel the operation.
ar: طُلبت تعمية TLS ولكنّ خادم الغربال لم يعلن TLS في إمكانيّاته. يمكنك تجربة تمهيد مفاوضات TLS رغم ذلك، أو إلغاء العمليّة.
he: התבקשה הצפנת TLS אבל שרת ה־Sieve שלך לא מפרסם TLS כחלק מהיכולות שלו. אפשר לנסות לאתחל שיחות TLS בכל אופן או לבטל את הפעולה.

# @title:window
source: Sieve Server Does Not Advertise TLS
ar: خادم الغربال لا يعلن عن TLS
he: שרת ה־Sieve אינו מפרסם TLS

# @action:button
source: &Start TLS nonetheless
ar: اب&دأ TLS رغم ذلك
he: התחלת TLS בכל &זאת

source: TLS encryption requested, but not supported by server.
ar: طُلبت تعمية TLS، ولكنّ الخادم لا يدعمها.
he: התבקשה הצפנת TLS, אבל בשרת אין תמיכה בזה.

source: The server does not seem to support TLS. Disable TLS if you want to connect without encryption.
ar: لا يبدو أنّ الخادم يدعم SASL. عطّل TLS إن أردت الاتّصال دون تعمية.
he: לא נראה שהשרת תומך ב־TLS. יש להשבית TLS כדי להתחבר בלי הצפנה.

source: Sieve Authentication Details
ar: تفاصيل استيثاق الغربال
he: פרטי אימות Sieve

source: Please enter your authentication details for your sieve account "%1" (usually the same as your email password):
ar: رجاءً أدخِل تفاصيل الاستيثاق لحساب الغربال "%1" (غالبًا ما تكون مثل البريد وكلمة السر):
he: נא למלא את פרטי האימות לחשבון ה־Sieve שלך „%1” (בדרך כלל כמו הסיסמה של הדוא״ל שלך):

source: The Sieve server on %1 has reported an error: %2
ar: أبلغ خادم الغربال الموجود على %1 عن خطأ: %2
he: שרת ה־Sieve ב־%1 דיווח על שגיאה: %2

# @title:window
source: Sieve Manager
ar: مدير الغربال
he: מנהל Sieve

source: Authentication failed. Most likely the password is wrong. The server responded: %1
ar: فشل الاستيثاق. غالبًا ما تكون كلمة السر خاطئة. ردّ الخادم بِ‍: %1
he: האימות נכשל. כפי הנראה הסיסמה שגויה. השרת הגיב: %1

source: The script did not upload successfully. This is probably due to errors in the script. The server responded: %1
ar: لم يُرفع السّكربت بنجاح. غالبًا ما يكون هذا بسبب أخطاء في السّكربت ذاته. ردّ الخادم بِ‍: %1
he: הסקריפט לא עלה כראוי. כנראה שזה עקב שגיאות בסקריפט. תגובת השרת הייתה: %1

source: The script did not upload successfully. The script may contain errors.
ar: لم يُرفع السّكربت بنجاح يحتوي السّكربت أخطاءً.
he: הסקריפט לא עלה כראוי. הסקריפט עלול להכיל שגיאות.

source: Parse error: Carriage Return (CR) without Line Feed (LF)
ar: خطأ تحليل: عودة مؤشر (CR) بدون تلقيم سطر (LF)
he: שגיאת פענוח: Carriage Return (CR - החזרת גרר) בלי Line Feed (LF - ירידת שורה)

source: Parse error: Unquoted Slash ('/') without Asterisk ('*'). Broken Comment?
ar: خطأ تحليل: شرطة مائلة غير مقتبسة ('/') بدون نجمة ('*'). هل التعليق مكسور؟
he: שגיאת פענוח: לוכסן ללא מירכאות ('/') בלי כוכבית ('*'). הערה חלקית?

source: Parse error: Illegal Character
ar: خطأ تحليل: حرف غير قانوني
he: שגיאת פענוח: תו שגוי

source: Parse error: Unexpected Character, probably a missing space?
ar: خطأ تحليل: حرف غير متوقع، ربما مسافة مفقودة؟
he: שגיאת פענוח: תו לא צפוי, אולי חסר רווח?

source: Parse error: Tag Name has leading Digits
ar: خطأ تحليل: اسم الوسم لديه أرقام بادئة
he: שגיאת פענוח: שם התגית נפתח בספרות

source: Parse error: Only whitespace and #comments may follow "text:" on the same line
ar: خطأ تحليل: يمكن فقط للمسافات البيضاء و#التعليقات أن تتبع "نص:" على نفس السطر
he: שגיאת פענוח: אחרי „text:‎” יכולים לבוא רק רווחים או #הערות באותה השורה

source: Parse error: Number out of Range (must be smaller than %1)
ar: خطأ تحليل: رقم خارج النطاق (يجب أن يكون أصغر من %1)
he: שגיאת פענוח: המספר מחוץ לטווח (חייב להיות קטן מ־%1)

source: Parse error: Invalid UTF-8 sequence
ar: خطأ تحليل: تسلسل UTF-8 غير صالح
he: שגיאת פענוח: רצף UTF-8 שגוי

source: Parse error: Premature end of Multiline String (did you forget the '.'?)
ar: خطأ تحليل: نهاية مبكرة لسلسلة متعددة الأسطر (هل نسيت النقطة '.')؟
he: שגיאת פענוח: סיום טרם עת של מחרוזת מרובת שורות (שכחת את ה‏־‚.’?)

source: Parse error: Premature end of Quoted String (missing closing '"')
ar: خطأ تحليل: نهاية مبكرة لسلسلة مقتبسة (علامة اقتباس إغلاق '"' مفقودة)
he: שגיאת פענוח: סיום בטרם עת של מחרוזת במירכאות (חסר ‚"’ סוגר)

source: Parse error: Premature end of String List (missing closing ']')
ar: خطأ تحليل: نهاية مبكرة لقائمة سلاسل (قوس إغلاق ']' مفقود)
he: שגיאת פענוח: סיום בטרם עת של רשימת מחרוזות (חסר ‚[’ סוגר)

source: Parse error: Premature end of Test List (missing closing ')')
ar: خطأ تحليل: نهاية مبكرة لقائمة اختبار (قوس إغلاق ')' مفقود)
he: שגיאת פענוח: סיום בטרם עת של רשימת בדיקות (חסר ‚(’ סוגר)

source: Parse error: Premature end of Block (missing closing '}')
ar: خطأ تحليل: نهاية مبكرة لكتلة (قوس إغلاق '}' مفقود)
he: שגיאת פענוח: סיום בטרם עת של מקטע (חסר ‚{’ סוגר)

source: Parse error: Missing Whitespace
ar: خطأ تحليل: مسافة بيضاء مفقودة
he: שגיאת פענוח: חסר רווח

source: Parse error: Missing ';' or Block
ar: خطأ تحليل: ';' أو كتلة مفقودة
he: שגיאת פענוח: חסר ‚;’ או מקטע

source: Parse error: Expected ';' or '{', got something else
ar: خطأ تحليل: توقعت ';' أو '{' ووجدت شيئًا آخر
he: שגיאת פענוח: אמור היה להיות ‚;’ או ‚}’, הגיע משהו אחר

source: Parse error: Expected Command, got something else
ar: خطأ تحليل: توقعت أمرًا ووجدت شيئًا آخر
he: שגיאת פענוח: אמורה הייתה להגיע פקודה, הגיע משהו אחר

source: Parse error: Trailing, Leading or Duplicate Commas in String List
ar: خطأ تحليل: فواصل زائدة أو بادئة أو مكررة في قائمة السلاسل
he: שגיאת פענוח: פסיקים פותחים, סוגרים או כפולים ברשימת המחרוזות

source: Parse error: Trailing, Leading or Duplicate Commas in Test List
ar: خطأ تحليل: فواصل زائدة أو بادئة أو مكررة في قائمة الاختبارات
he: שגיאת פענוח: פסיקים פותחים, סוגרים או כפולים ברשימת הבדיקה

source: Parse error: Missing ',' between Strings in String List
ar: خطأ تحليل: ',' مفقودة بين السلاسل في قائمة السلاسل
he: שגיאת פענוח: חסר ‚;’ בין מחרוזות ברשימת המחרוזות

source: Parse error: Missing ',' between Tests in Test List
ar: خطأ تحليل: ',' مفقودة بين الاختبارات في قائمة الاختبارات
he: שגיאת פענוח: חסר ‚;’ בין בדיקות ברשימת הבדיקות

source: Parse error: Only Strings allowed in String Lists
ar: خطأ تحليل: فقط السلاسل مسموح بها في قوائم السلاسل
he: שגיאת פענוח: מותר רק מחרוזות ברשימת המחרוזות

source: Parse error: Only Tests allowed in Test Lists
ar: خطأ تحليل: فقط الاختبارات مسموح بها في قوائم الاختبارات
he: שגיאת פענוח: מותר רק בדיקות ברשימת הבדיקות

source: "require" must be first command
ar: "مطلوب" يجب أن يكون أول أمر
he: „require” (דורש) חייבת להיות הפקודה הראשונה

source: "require" missing for command "%1"
ar: "مطلوب" مفقود للأمر "%1"
he: חסר „require” (דורש) לפקודה „%1”

source: "require" missing for test "%1"
ar: "مطلوب" مفقود للاختبار "%1"
he: חסר „require” (דורש) לבדיקה „%1”

source: "require" missing for comparator "%1"
ar: "مطلوب" مفقود للمقارن "%1"
he: חסר „require” (דורש) למשווה „%1”

source: Command "%1" not supported
ar: الأمر "%1" ليس متاح
he: אין תמיכה בפקודה „%1”

source: Test "%1" not supported
ar: اختبار "%1" ليس متاح
he: אין תמיכה בפקודה „%1”

source: Comparator "%1" not supported
ar: المقارن "%1" ليس متاح
he: המשווה „%1” לא נתמך

source: Site Policy Limit Violation: Test nesting too deep (max. %1)
ar: انتهاك سياسة الموقع: تعشيش الاختبار عميق جداً (الحد الأقصى %1)
he: הפרת מגבלת מדיניות אתר: קינון הבדיקה עמוק מדי (%1 לכל היותר)

source: Site Policy Limit Violation: Block nesting too deep (max. %1)
ar: انتهاك سياسة الموقع: تعشيش الكتلة عميق جداً (الحد الأقصى %1)
he: הפרת מגבלת מדיניות אתר: קינון המקטע עמוק מדי (%1 לכל היותר)

source: Invalid Argument "%1" to "%2"
ar: معامل غير صالح "%1" إلى "%2"
he: ארגומנט „%1” שגוי אל „%2”

source: Conflicting Arguments: "%1" and "%2"
ar: معاملات متعارضة: "%1" و "%2"
he: ארגומנטים סותרים: „%1” ו־„%2”

source: Argument "%1" Repeated
ar: المعامل "%1" مكرر
he: הארגומנט „%1” חוזר על עצמו

source: Command "%1" violates command ordering constraints
ar: الأمر "%1" ينتهك قيود ترتيب الأوامر
he: הפקודה „%1” מפרה את מגבלות סדר הפקודות

source: Incompatible Actions "%1" and "%2" requested
ar: طلب إجراءات غير متوافقة "%1" و "%2"
he: התבקשו הפקודות „%1” ו־„%2” שאינן תואמות

source: Mail Loop detected
ar: اكتشاف حلقة بريد
he: התגלתה לולאת דוא״ל

source: Site Policy Limit Violation: Too many Actions requested (max. %1)
ar: انتهاك سياسة الموقع: طلب عدد كبير جداً من الإجراءات (الحد الأقصى %1)
he: הפרת מגבלת מדיניות אתר: התבקשו יותר מדי פעולות (%1 לכל היותר)

source: Unknown error
ar: خطأ مجهول
he: שגיאה לא ידועה

source: No errors found.
ar: لم يعثر على أخطاء.
he: לא נמצאו שגיאות.

source: An unknown error was encountered.
ar: حدث خطأ غير معروف.
he: אירעה שגיאה לא ידועה.

source: Path is not specified.
ar: لم تحديد المسار.
he: לא צוין נתיב.

source: Error writing "MASTER" script on server. The server responded: %1
ar: خطأ في كتابة السكربت "MASTER" على الخادم. استجاب الخادم: %1
he: שגיאה בכתיבת סקריפט „MASTER” (על) לשרת. תגובת השרת הייתה: %1

source: Error writing "User" script on server. The server responded: %1
ar: خطأ في كتابة السكربت "User" على الخادم. استجاب الخادم: %1
he: שגיאה בכתיבת סקריפט „User” (משתמש) לשרת. תגובת השרת הייתה: %1

source: Retrieving the script failed. The server responded: %1
ar: فشل استرداد السكربت. استجاب الخادم: %1
he: משיכת הסקריפט נכשלה. תגובת השרת הייתה: %1

source: Script is empty. (%1)
ar: السكربت فارغ. (%1)
he: הסקריפט ריק. (%1)

source: Script parsing error.
ar: خطأ في تحليل السكربت.
he: שגיאת פענוח סקריפט.

source: Impossible to start job
ar: لا يمكن بدء المهمة
he: לא ניתן להתחיל משימה

source: An error occurred during loading the sieve script.
ar: حدث خطأ أثناء تحميل سكربت الغربال.
he: אירעה שגיאה במהלך טעינת סקריפט ה־sieve.

source: An error occurred during saving the sieve script.
ar: حدث خطأ أثناء حفظ سكربت الغربال.
he: אירעה שגיאה במהלך שמירת סקריפט ה־sieve.

source: An error occurred during deleting the sieve script.
ar: حدث خطأ أثناء حذف سكربت الغربال.
he: אירעה שגיאה במהלך מחיקת סקריפט ה־sieve.

source: Allow out-of-office settings to be changeable by the user.
ar: اسمح للمستخدم بتغيير إعدادات خارج المكتب.
he: לאפשר למשתמש לשנות את הגדרות מחוץ למשרד.

source: Allow users to upload out-of-office sieve scripts, but prevent them from changing any settings, such as the domain to react to or the spam reaction switch.
ar: اسمح للمستخدمين بتحميل سكربتات الغربال خارج المكتب، ولكن امنعهم من تغيير أي إعدادات، مثل النطاق للتفاعل معه أو مفتاح التفاعل مع الرسائل المزعجة.
he: לאפשר למשתמשים להעלות סקריפטים של sieve למצב „מחוץ למשרד”, אבל למנוע מהם לשנות הגדרות כלשהן, כגון שם התחום להגיב אליו או להחליף את תגובת הספאם.

source: Send out-of-office replies to mails coming from this domain only.
ar: أرسل الردود خارج المكتب إلى الرسائل البريدية القادمة من هذا النطاق فقط.
he: לשלוח תגובות מחוץ למשרד להודעות שמגיעות משם התחום הזה בלבד.

source: Allow out-of-office replies to be sent to messages marked as SPAM.
ar: اسمح بإرسال الردود خارج المكتب إلى الرسائل التي صنفت كرسائل مزعجة.
he: לאפשר לשלוח תגובות מחוץ למשרד להודעות שמסומנות כספאם.

source: Check if there is still an active out-of-office reply configured on startup.
ar: تحقق ما إذا كان هناك رد خارج المكتب نشط عند بدء التشغيل.
he: לבדוק אם יש עדיין תגובת מחוץ למשרד פעילה ומוגדרת עם העלייה.

source: ParseUserScriptJob failed: %1
ar: فشلت ParseUserScriptJob: %1
he: ‏ParseUserScriptJob (משימת פענוח סקריפט משתמש) נכשלה: %1

source: Failed to get the list of Sieve scripts. The server responded: %1
ar: فشل في الحصول على قائمة سكربتات الغربال. استجاب الخادم: %1
he: משיכת רשימת הסקריפטים של Sieve נכשלה. השרת הגיב: %1

source: Sieve script installed successfully on the server '%1'. Out of Office reply is now active.
ar: سكربت الغربال مثبّت بنجاح على الخادم '%1'. الرد خارج المكتب نشط الآن.
he: סקריפט ה־Sieve הותקן בהצלחה בשרת ‚%1’. תגובת מחוץ למשרד פעילה כעת.

source: Sieve script installed successfully on the server '%1'. Out of Office reply has been deactivated.
ar: سكربت الغربال مثبّت بنجاح على الخادم '%1'. الرد خارج المكتب ألغي تنشيطه.
he: סקריפט ה־Sieve הותקן בהצלחה בשרת ‚%1’. תגובת מחוץ למשרד הושבתה.

source: Impossible to install script on server '%1'
ar: لا يمكن تثبيت السكربت على الخادم '%1'
he: אי אפשר להתקין סקריפט על השרת ‚%1’

source: Out of office till %1
ar: خارج المكتب حتى %1
he: מחוץ למשרד עד %1

source: Keep
ar: أبقِ
he: להשאיר

source: Discard
ar: أهمِل
he: לסלק

source: Redirect to
ar: أعِد التّوجيه إلى
he: להפנות אל

source: Copy to
ar: انسخ إلى
he: להעתיק אל

source: I am out of office till %1. In urgent cases, please contact Mrs. "vacation replacement" email: "email address of vacation replacement" phone: +49 711 1111 11 fax.: +49 711 1111 12 Yours sincerely, -- "enter your name and email address here"
ar: أنا خارج المكتب حتى %1. في الحالات الطارئة، رجاءً اتصل بالسيدة "بديل الإجازة" بريد إلكتروني: "عنوان البريد الإلكتروني لبديل الإجازة" هاتف: +49 711 1111 11 فاكس: +49 711 1111 12 مع خالص تحياتي، -- "أدخل اسمك وعنوان بريدك الإلكتروني هنا"
he: אני מחוץ למשרד עד %1. במקרים דחופים נא ליצור קשר עם „המחליף או המחליפה שלי” דוא״ל: „כתובת הדוא״ל של המחליף או המחליפה” טלפון: ‎+972 50 555 5555 פקס: ‎+972 3 555 5555 בברכה, -- „כאן יש למלא את השם ואת כתובת הדוא״ל שלך”

# @title:window
source: Create Sieve Filter
ar: أنشئ مرشح غربال
he: יצירת מסנן Sieve

source: Cannot find item "%1" in widget "%2"
ar: لا يمكن العثور على العنصر "%1" في الأداة "%2"
he: לא ניתן למצוא את הפריט „%1” בווידג׳ט „%2”

source: More information
ar: معلومات أخرى
he: פרטים נוספים

source: Not enough arguments for SelectConvertParameterWidget. Expected 2 arguments.
ar: لا توجد معاملات كافية لـ SelectConvertParameterWidget. المتوقع هو معاملان.
he: אין מספיק ארגומנטים ל־SelectConvertParameterWidget. אמורים להיות 2.

source: Too many arguments for SelectConvertParameterWidget, "%1"
ar: عدد كبير جداً من المعاملات لـ SelectConvertParameterWidget، "%1"
he: יותר מדי ארגומנטים ל־SelectConvertParameterWidget,‏ „%1”

source: px
ar: بكسل
he: פיקסלים

source: is
ar: هو
he: הוא

source: not is
ar: ليس
he: הוא לא

source: contains
ar: يحتوي
he: מכיל

source: not contains
ar: لا يحوي
he: לא מכיל

source: matches
ar: يطابق
he: תואם

source: not matches
ar: لا يطابق
he: לא תואם

source: regex
ar: تعبير نمطي
he: ביטוי רגולרי

source: not regex
ar: ليست تعبير نمطي
he: לא ביטוי רגולרי

source: BMP
ar: بي إم بي

source: An unknown tag value "%1" was found during parsing action "%2".
ar: وجدَت قيمة وسم غير معروفة "%1" أثناء تحليل الإجراء "%2".
he: נמצא ערך תגית שגוי „%1” במהלך פענוח הפעולה „%2”.

source: An unknown tag "%1" was found during parsing action "%2".
ar: وجدَت وسم غير معروف "%1" أثناء تحليل الإجراء "%2".
he: נמצאה תגית לא ידועה „%1” במהלך פענוח הפעולה „%2”.

source: Too many arguments found for "%1", max value is %2, number of value found %3 for %4
ar: وجدَت معاملات كثيرة جداً لـ "%1"، القيمة القصوى هي %2، وعدد القيم التي وجدت %3 لـ %4
he: נמצאו יותר מדי ארגומנטים עבור „%1”, הערך המרבי הוא %2, מספר הערך שנמצא %3 עבור %4

source: A feature "%1" in condition "%2" is not supported by server
ar: ميزة "%1" في الشرط "%2" لا يدعمها الخادم
he: יכולת „%1” בתנאי „%2” לא נתמכת על ידי השרת

# @info:tooltip
source: Help
ar: مساعدة
he: עזרה

source: Add Flags
ar: أضف إشارات
he: הוספת דגלונים

source: Addflag is used to add flags to a list of [IMAP] flags. It doesn't replace any previously set flags. This means that multiple occurrences of addflag are treated additively.
ar: يُستخدم Addflag لإضافة إشارات إلى قائمة إشارات [IMAP]. لا تحل محل أي علامات موضوعة مسبقًا. هذا يعني أن تكرارات addflag تعالج بشكل تراكمي.
he: Addflag (הוספת דגלון) משמש להוספת דגלונים לרשימת דגלוני [IMAP]. הוא לא מחליף דגלונים אחרים שהוגדרו קודם לכן. משמעות הדבר היא שכמה מופעים של הוספת דגלון מקבלים יחס של הוספה.

source: Add header
ar: أضف ترويسة
he: הוספת כותרת

# @label:textbox
source: header:
ar: الترويسة:
he: כותרת:

# @label:textbox
source: value:
ar: القيمة:
he: ערך:

source: The addheader action adds a header field to the existing message header.
ar: يضيف إجراء addheader حقلاً رأسياً إلى رأس الرسالة الموجود.
he: פעולת addheader (הוספת כותרת) מוסיפה שדה כותרת לכותרת ההודעה הנוכחית.

source: Break
ar: كاسر
he: קטיעה

# @label:textbox
source: Name (optional):
ar: الاسم (اختياري):
he: שם (רשות):

source: The break command terminates the closest enclosing loop.
ar: ينهي الأمر break أقرب حلقة محيطة.
he: פקודת break קוטעת את הלולאה העוטפת הקרובה ביותר.

source: Convert
ar: حوّل
he: המרה

# @label:textbox
source: From:
ar: من:
he: מ־:

# @label:textbox
source: To:
ar: إلى:
he: אל:

# @label:textbox
source: Parameters:
ar: المعاملات:
he: משתנים:

source: The "convert" action specifies that all body parts with a media type equal to "media-type" be converted to the media type in "media-type" using conversion parameters.
ar: يحدد الإجراء "convert" أن جميع أجزاء الجسم بنوع وسائط يساوي "media-type" يجب أن تحول إلى نوع الوسائط في "media-type" باستخدام معاملات التحويل.
he: פעולת „convert” (המרה) מציינת שכל חלקי התוכן שיש בהם מדיה מסוג שווה ל־„media-type” (סוג מדיה) יומרו לסוג המדיה שב־„media-type” באמצעות משתני המרה.

source: Delete header
ar: احذف الرأس
he: מחיקת כותרת

source: By default, the deleteheader action deletes all occurrences of the named header field.
ar: بشكل مبدئي، يحذف إجراء deleteheader جميع تكرارات حقل الرأس المسمى.
he: כברירת מחדל, פעולת „deleteheader” (מחיקת כותרת) מוחקת את כל המופעים של שדה הכותרת בשם מסוים.

source: Discard is used to silently throw away the message.
ar: يُستخدم Discard للتخلص من الرسالة بصمت.
he: Discard (סילוק) משמש לסלק את ההודעה באופן חרישי.

source: Enclose
ar: ضمّن
he: אריזה

# @label:textbox
source: Subject:
ar: الموضوع:
he: נושא:

# @label:textbox
source: headers:
ar: التّرويسات:
he: כותרות:

# @label:textbox
source: text:
ar: النص:
he: טקסט:

source: Enclose action command is defined to allow an entire message to be enclosed as an attachment to a new message.
ar: يعرّف أمر إجراء enclose للسماح بضم رسالة كاملة كمرفق برسالة جديدة.
he: פעולת האריזה (enclose) מוגדרת להרשות לצרף הודעה שלמה להודעה חדשה.

source: The "ereject" action cancels the implicit keep and refuses delivery of a message.
ar: يلغي الإجراء "ereject" الإبقاء الضمني ويرفض تسليم الرسالة.
he: פעולת ה־„ereject” (דחייה מורחבת) מבטלת את ההשארה המרומזת ומסרבת לשליחת ההודעה.

source: Extract Text
ar: استخرج النص
he: חילוץ טקסט

# @label:textbox
source: Number of characters:
ar: عدد المحارف:
he: מספר התווים:

# @label:textbox
source: Stored in variable name:
ar: اسم المتغيّر:
he: מאוחסנים בשם משתנה:

source: The "extracttext" action may be used within the context of a "foreverypart" loop and is used to store text into a variable
ar: قد يستخدم الإجراء "extracttext" ضمن سياق حلقة "foreverypart" ويستخدم لتخزين النص في متغير
he: אפשר להשתמש בפעולת „extracttext” (חילוץ טקסט) בתוך ההקשר של לולאת „foreverypart” (לכל חלק) והיא משמשת לאחסון טקסט במשתנה.

source: File Into
ar: أرسل إلى
he: תיוק לתוך

source: Action "fileinto" has "copy" argument but current server does not support it
ar: الإجراء "fileinto" لديه معامل "copy" لكن الخادم الحالي لا يدعمه
he: לפעולה „fileinto” (תיוק לתוך) יש ארגומנט „copy” (העתקה) אבל השרת הנוכחי לא תומך בו

# @option:check
source: Keep a copy
ar: احتفظ بنسخة
he: להשאיר עותק

# @option:check
source: Create folder
ar: أنشئ مجلّدًا
he: יצירת תיקייה

source: The "fileinto" action delivers the message into the specified mailbox.
ar: يسلم الإجراء "fileinto" الرسالة إلى صندوق البريد المحدد.
he: פעולת „fileinto” (תיוק לתוך) מוסרת את ההודעה לתוך תיבת הדוא״ל שצוינה.

source: If the optional ":create" argument is specified, it instructs the Sieve interpreter to create the specified mailbox, if needed, before attempting to deliver the message into the specified mailbox.
ar: إذا حدد المعامل الاختياري ":create"، فإنه يوجه مترجم الغربال لإنشاء صندوق البريد المحدد، إذا لزم الأمر، قبل محاولة تسليم الرسالة إلى صندوق البريد المحدد.
he: אם צוין הארגומנט כרשות „‎:create”, הוא מנחה את מפענח ה־Sieve ליצור את תיבת הדוא״ל שצוינה, במקרה הצורך, בטרם הניסיון להעביר את ההודעה לתיבת הדוא״ל שצוינה.

source: If the optional ":copy" keyword is specified, the tagged command does not cancel the implicit "keep". Instead, it merely files or redirects a copy in addition to whatever else is happening to the message.
ar: إذا حدد الكلمة المفتاحية الاختيارية ":copy"، فإن الأمر الموسوم لا يلغي "الإبقاء" الضمني. بدلاً من ذلك، فإنه يقوم فقط بتخزين أو إعادة توجيه نسخة بالإضافة إلى أي شيء آخر يحدث للرسالة.
he: אם צוינה מילת המפתח כרשות „‎:copy”, הפקודה המתויגת לא מבטלת את ה־„keep” המרומז. במקום, היא בסך הכול מתייקת או מפנה עותק בנוסף לכל דבר אחר שאמור לקרות להודעה.

source: The "keep" action is whatever action is taken in lieu of all other actions, if no filtering happens at all; generally, this simply means to file the message into the user's main mailbox.
ar: إجراء "keep" هو أي إجراء يؤخذ بدلاً من جميع الإجراءات الأخرى، إذا لم يحدث أي تصفية على الإطلاق؛ بشكل عام، هذا يعني ببساطة إرسال الرسالة إلى صندوق البريد الرئيس للمستخدم.
he: פעולת „keep” (להשאיר) היא הפעולה שננקטת במקום הפעולות האחרות, אם לא מתרחש שום סינון. באופן כללי, זה פשוט מבקש לתייק את ההודעה לתיבת ההודעות הראשית של המשתמש.

# @label:textbox
source: Add flags:
ar: أضف إشارات:
he: הוספת דגלונים:

source: Notify
ar: أخطر
he: הודעה

# @label:textbox
source: message:
ar: الرسالة:
he: הודעה:

# @label:textbox
source: method:
ar: الوسيلة:
he: שיטה:

source: The "notify" action specifies that a notification should be sent to a user.
ar: يحدد الإجراء "notify" أنه يجب إرسال إشعار إلى المستخدم.
he: פעולת „notify” (הודעה) מציינת שיש לשלוח הודעה למשתמש.

source: Redirect
ar: أعد التوجيه
he: הפניה

# @option:check
source: Use list
ar: استخدم القائمة
he: להשתמש ברשימה

source: The "redirect" action is used to send the message to another user at a supplied address, as a mail forwarding feature does. The "redirect" action makes no changes to the message body or existing headers, but it may add new headers.
ar: يُستخدم إجراء "redirect" لإرسال الرسالة إلى مستخدم آخر في عنوان مزود، كما تفعل ميزة إعادة توجيه البريد. لا يجري إجراء "redirect" أي تغييرات على جسم الرسالة أو الرؤوس الموجودة، ولكنه قد يضيف رؤوسًا جديدة.
he: פעולת ה־„redirect” (הפניה) משמשת לשליחת ההודעה למשתמש אחר בכתובת שסופקה, כמו שעושה יכולת העברת דוא״ל. פעולת „redirect” לא מבצעת שינויים בתוכן ההודעה או בכותרות הקיימות אך היא עשויה להוסיף כותרות חדשות.

source: If the optional ":copy" keyword is specified, the tagged command does not cancel the implicit "keep". Instead, it redirects a copy in addition to whatever else is happening to the message.
ar: إذا حددت الكلمة المفتاحية الاختيارية ":copy"، فإن الأمر الموسوم لا يلغي "الإبقاء" الضمني. بدلاً من ذلك، فإنه يعيد توجيه نسخة بالإضافة إلى أي شيء آخر يحدث للرسالة.
he: אם צוינה מילת המפתח כרשות „‎:copy”, הפקודה המתויגת לא מבטלת את ה־„keep” המרומז. במקום, היא מפנה עותק בנוסף לכל דבר אחר שאמור לקרות להודעה.

source: Reject
ar: ارفض
he: דחייה

source: The "reject" action cancels the implicit keep and refuses delivery of a message.
ar: يلغي الإجراء "reject" الإبقاء الضمني ويرفض تسليم الرسالة.
he: פעולת ה־„reject” (דחייה) מבטלת את ההשארה המרומזת ומסרבת לשליחת ההודעה.

source: Remove Flags
ar: أزل الإشارات
he: הסרת דגלונים

source: Removeflag is used to remove flags from a list of [IMAP] flags. Removeflag clears flags previously set by "set"/"addflag". Calling removeflag with a flag that wasn't set before is not an error and is ignored.
ar: يستخدم Removeflag لإزالة الإشارات من قائمة إشارات [IMAP]. تمسح Removeflag الإشارات المعينة مسبقًا بواسطة ”'"set"/"addflag". لا يعد استدعاء ” Removeflag“ لإشارة لم تُعيَّن من قبل خطأ وسيُهمل.
he: Removeflag (הסרת דגלון) משמשת להסרת דגלונים מרשימת דגלוני [IMAP]. Removeflag מסלקת דגלונים שהוגדרו בעבר על ידי ‎„set”/„addflag”‎ (הגדרה/הוספת דגל בהתאמה). הקריאה ל־removeflag עם דגלון שלא הוגדר בעבר אינה שגיאה והיא תזכה להתעלמות.

source: Replace
ar: استبدل
he: החלפה

# @label:textbox
source: from:
ar: من:
he: מ־:
