Repository: KDE/libksieve
Catalog: po/*/libksieve6.po
Languages: ar, he

source: The "replace" command is defined to allow a MIME part to be replaced with the text supplied in the command.
ar: يعرف الأمر "replace" للسماح باستبدال جزء MIME بالنص المزود في الأمر.
he: הפקודה „replace” (החלפה) מוגדרת להרשות את חלק ה־MIME להחלפה בטקסט שסופק בפקודה.

source: Return
ar: أرجع
he: החזרה

source: The "return" command stops processing of the immediately included script only and returns processing control to the script that includes it.
ar: يوقف الأمر "return" معالجة السكربت المضمن فوراً فقط ويعيد التحكم في المعالجة إلى السكربت الذي يضمنه.
he: הפקודה „return” (החזרה) עוצרת את עיבוד הסקריפט שנכלל מיידית בלבד ומחזירה את פקד העיבוד לסקריפט שבו הוא נכלל.

source: Set Flags
ar: ضعّ إشارات
he: הגדרת דגלונים

source: Setflag is used for setting [IMAP] system flags or keywords. Setflag replaces any previously set flags.
ar: يُستخدم Setflag لتعيين إشارات أو كلمات أساسية لنظام [IMAP]. يستبدل Setflag أي إشارات معينة سابقاً.
he: Setflag (הגדרת דגלונים) משמשת להגדרת דגלוני מערכת או מילות מפתח של [IMAP]. Setflag מחליפה כל דגלון שהוא שהוגדר קודם לכן.

source: Variable
ar: متغير
he: משתנה

# @option:check
source: Protect special character
ar: احمِ الحرف الخاص
he: הגנה על תווים מיוחדים

# @label:textbox
source: Value:
ar: القيمة:
he: ערך:

# @label:textbox
source: In variable:
ar: في المتغير:
he: במשתנה:

source: Script needs regex support, but server does not have it.
ar: السكربت يحتاج إلى دعم التعبير العادي (regex)، ولكن الخادم لا يملكه.
he: הסקריפט צריך תמיכה בביטויים רגולרים אבל אין אותה בשרת.

source: The "set" action stores the specified value in the variable identified by name.
ar: يخزن الإجراء "set" القيمة المحددة في المتغير المعرف بالاسم.
he: פעולת „set” (הגדרה) מאחסן את הערך שצוין במשתנה שמזוהה בשם.

source: This modifier adds the necessary quoting to ensure that the expanded text will only match a literal occurrence if used as a parameter to :regex. Every character with special meaning (. , *, ? , etc.) is prefixed with \ in the expansion
ar: يضيف هذا المعدّل الاقتباس الضروري لضمان أن النص الموسع سيطابق فقط تكرارًا حرفيًا إذا استخدم كمعامل لـ :regex. كل حرف له معنى خاص (., ,, *, ?, إلخ) يسبقه \ في التوسيع.
he: פונקציית ההחלפה הזאת מוסיפה את המירכאות הנחוצות כדי לוודא שהטקסט שמורחב יענה רק על מופע מילולי אם ייעשה בו שימוש כמשתנה ל־‎:regex. לפני כל תו עם משמעות מיוחדת (. , *, ? , ועוד) מתווסף \ בזמן ההרחבה.

source: Stop
ar: أوقف
he: עצירה

source: The "stop" action ends all processing. If the implicit keep has not been cancelled, then it is taken.
ar: ينهي الإجراء "stop" جميع عمليات المعالجة. إذا لم يُلغ الإبقاء الضمني، فإنه يُؤخذ.
he: פעולת ה־„stop” מסיימת את כל העיבוד. אם ההשארה המרומזת לא בוטלה, אז היא נלקחת.

source: Vacation
ar: عطلة
he: חופשה

# @label:textbox
source: day:
ar: يوم:
he: יום:

# @label:textbox
source: Message subject:
ar: عنوان الرّسالة:
he: נושא ההודעה:

# @label:textbox
source: Additional email:
ar: بريد إلكتروني إضافي:
he: כתובת דוא״ל נוספת:

# @label:textbox
source: Vacation reason:
ar: سبب العطلة:
he: סיבה לחופשה:

source: The "vacation" action implements a vacation autoresponder similar to the vacation command available under many versions of Unix. Its purpose is to provide correspondents with notification that the user is away for an extended period of time and that they should not expect quick responses.
ar: ينفذ الإجراء "vacation" ردًا آليًا للإجازة يشبه أمر الإجازة المتاح في العديد من إصدارات Unix. الغرض منه هو تزويد المراسلين بإشعار بأن المستخدم غائب لفترة طويلة من الزمن وأنه يجب ألا يتوقعوا ردودًا سريعة.
he: פעולת „vacation” (חופשה) מטמיעה משיב אוטומטי בזמן חופשה בדומה לפקודת vacation שקיימת במגוון גרסאות יוניקס. המטרה שלה היא לספק תכתובת עם התראה שהמשתמש או המשתמשת לא זמינים למשך זמן ממושך ושאין מה לצפות למענה מהיר מהם.

source: Through the ":days" parameter, it limits the number of auto-replies to the same sender to one per [n] days, for a specified number of days. But there are cases when one needs more granularity, if one would like to generate "vacation" replies more frequently.
ar: من خلال المعامل ":days"، فإنه يحد عدد الردود التلقائية إلى نفس المرسل بواحد لكل [n] يومًا، لعدد محدد من الأيام. ولكن هناك حالات يحتاج فيها المرء إلى المزيد من الدقة، إذا كان يرغب في توليد ردود "إجازة" بشكل أكثر تكراراً.
he: דרך המשתנה „‎:days”, מספר התגובות האוטומטיות לאותו השולחן מוגבלות לאחת כל [n] ימים, למספר ימים מוגדר. אבל יש מקרים שצריך לדייק מעבר לזה, כדי לייצר תגובות „חופשה” (vacation) באופן יותר תדיר.

source: This extension defines a ":seconds" parameter to provide more granularity for such situations.
ar: يحدد هذا الامتداد معامل ":seconds" لتوفير دقة أكبر لهذه الحالات.
he: ההרחבה מציינת משתנה „:שניות” (‎:seconds) כדי לספק יותר דיוק במצבים שכאלה.

# @info:placeholder
source: Define Email Address…
ar: حدد عنوان البريد الإلكتروني…
he: הגדרת כתובת דוא״ל…

# @info:placeholder
source: Enter message…
ar: أدخل الرسالة…
he: נא למלא הודעה…

source: Insert at the beginning
ar: أدرج في البداية
he: הוספה בהתחלה

source: Append at the end
ar: ألحق في النهاية
he: הוספה לסוף

# @title:window
source: Flags
ar: الإشارات
he: דגלונים

source: Deleted
ar: حُذف
he: נמחקה

source: Answered
ar: مجابة
he: נענתה

source: Flagged
ar: معلمة
he: סומנה בדגלון

source: Seen
ar: شوهدت
he: נצפתה

source: Draft
ar: مسودة
he: טיוטה

# @info:placeholder
source: Click on button for selecting flags…
ar: اضغط على زر اختيار الإشارات…
he: יש ללחוץ על הכפתור כדי לבחור דגלונים…

# @info:tooltip
source: Select Flags
ar: حدد الإشارات
he: בחירת דגלונים

source: high importance
ar: أهمية عالية
he: חשיבות גבוהה

source: normal importance
ar: أهمية عادية
he: חשיבות רגילה

source: low importance
ar: أهمية منخفضة
he: חשיבות נמוכה

source: days
ar: يوم
he: ימים

source: seconds
ar: ثانية
he: שניות

source: None
ar: بلا
he: ללא

source: Lower
ar: أحرف صغيرة
he: אות קטנה

source: Upper
ar: أحرف كبيرة
he: אות גדולה

source: Lower first letter
ar: حرف أول سفلي
he: להקטין את האות הראשונה

source: Upper first letter
ar: حرف أول علوي
he: להגדיל את האות הראשונה

source: Quote wildcard
ar: اقتبس الحرف الجامع
he: תו הכללה של ציטוט

source: Length
ar: الطّول
he: אורך

# @label:textbox
source: Please select an action.
ar: رجاء اختر إجراءً.
he: נא לבחור פעולה.

# @info:tooltip
source: Add comment
ar: أضف تعليقًا
he: הוספת הערה

source: Script contains unsupported feature "%1"
ar: السكربت يحتوي على ميزة غير مدعومة "%1"
he: הסקריפט מכיל יכולת לא נתמכת „%1”

source: We detected a loop if in a loop if. It's not supported
ar: اكتشفنا حلقة if في حلقة if. هذا لا يدعم
he: זיהינו לולאת אם בתוך לולאה. המצב הזה לא נתמך

source: Unknown tag "%1" during parsing condition "%2"
ar: وسم غير معروف "%1" أثناء تحليل الشرط "%2"
he: תגית לא ידועה „%1” במהלך פענוח התנאי „%2”

source: Too many argument found for "%1", max value is %2, number of value found %3 for %4
ar: وجدَت معاملات كثيرة جداً لـ "%1"، القيمة القصوى هي %2، وعدد القيم التي وجدت %3 لـ %4
he: נמצאו יותר מדי ארגומנטים עבור „%1”, הערך המרבי הוא %2, מספר הערך שנמצא %3 עבור %4

source: An unknown tag value "%1" was found during parsing condition "%2".
ar: وجدَت قيمة وسم غير معروفة "%1" أثناء تحليل الشرط "%2".
he: נמצא ערך תגית לא ידוע „%1” במהלך פענוח התנאי „%2”.

source: Address
ar: العنوان
he: כתובת

# @label:textbox
source: address:
ar: العنوان:
he: כתובת:

# @info:placeholder
source: Use ; to separate emails
ar: استخدم ؛ للفصل بين عناوين البريد الإلكتروني
he: להשתמש ב־; כדי להפריד כתובות דוא״ל

source: The "address" test matches Internet addresses in structured headers that contain addresses. It returns true if any header contains any key in the specified part of the address, as modified by the comparator and the match keyword.
ar: يطابق اختبار "address" عناوين الإنترنت في الرؤوس المنظمة التي تحتوي على عناوين. ويعيد صحيحًا إذا كان أي رأس يحتوي على أي مفتاح في الجزء المحدد من العنوان، كما عُدِّل بواسطة المقارن وكلمة مفتاح المطابقة.
he: בדיקת „address” (כתובת) בודקת כתובות אינטרנט בכותרות שבתבניות מוסכמות ומכילות כתובות. היא מחזירה חיובי (true) אם כותרת כלשהי מכילה מפתח כלשהו בחלק של הכתובת שצוין, כפי שהשתנה על ידי סימן ההשוואה ומילת המפתח להתאמה.

source: Body
ar: المتن
he: תוכן

source: The body test matches content in the body of an email message, that is, anything following the first empty line after the header. (The empty line itself, if present, is not considered to be part of the body.)
ar: يطابق اختبار الجسم المحتوى في جسم رسالة البريد الإلكتروني، أي أي شيء يتبع السطر الفارغ الأول بعد الرأس. (السطر الفارغ نفسه، إن وُجِد، لا يعتبر جزءًا من الجسم.)
he: בדיקת ה־„body” (תוכן גוף ההודעה) מנסה לבדוק את תוכן הודעת דוא״ל, כלומר, כל מה שאחרי השורה הריקה של הכותרת. (השורה הריקה עצמה, אם קיימת, לא נחשבת חלק מגוף תוכן ההודעה).

source: Currentdate
ar: التاريخ_الحالي
he: תאריך נוכחי

source: The currentdate test is similar to the date test, except that it operates on the current date/time rather than a value extracted from the message header.
ar: اختبار currentdate يشبه اختبار date، باستثناء أنه يعمل على التاريخ/الوقت الحالي بدلاً من قيمة مستخرجة من رأس الرسالة.
he: בדיקת „currentdate” (תאריך נוכחי) דומה לבדיקת התאריך (date), למעט העובדה שהיא פועלת על התאריך/זמן הנוכחיים במקום הערך שחולץ מכותרת ההודעה.

source: Date
ar: التاريخ
he: תאריך

source: The date test matches date/time information derived from headers containing date-time values.
ar: يطابق اختبار date معلومات التاريخ/الوقت المشتقة من الرؤوس التي تحتوي على قيم التاريخ والوقت.
he: בדיקת התאריך בודקת את פרטי התאריך/שעה שנגזרים מהכותרת שמכילה את ערכי התאריך-שעה.

source: Envelope
ar: ظرف بريدي
he: מעטפה

source: The "envelope" test is true if the specified part of the [SMTP] (or equivalent) envelope matches the specified key.
ar: اختبار "envelope" صحيح إذا كان الجزء المحدد من مغلف [SMTP] (أو ما يعادله) يطابق المفتاح المحدد.
he: בדיקת ה־„envelope” (מעטפה) מפוענת ל־true (חיובי) אם החלק שצוין של מעטפת ה־[SMTP] (או כל חלק מקביל) תואם למפתח שצוין.

source: Environment
ar: البيئة
he: סביבה

# @label:textbox
source: Item:
ar: العُنصر:
he: פריט:

source: The environment test retrieves the item of environment information specified by the name string and matches it to the values specified in the key-list argument.
ar: يسترد اختبار environment عنصر معلومات البيئة المحدد بواسطة سلسلة الاسم ويطابقه مع القيم المحددة في معامل قائمة المفاتيح.
he: בדיקת הסביבה מקבלת מושכת את הפריט של פרטי הסביבה שצוין על ידי מחרוזת השם ומנסה לתאם בינו לבין הערכים שצוינו בארגומנט רשימת מפתחות (key-list).

source: Exists
ar: موجود
he: קיים

source: exists
ar: موجود
he: קיים

source: not exists
ar: لا يوجد
he: לא קיים

source: The "exists" test is true if the headers listed in the header-names argument exist within the message. All of the headers must exist or the test is false.
ar: اختبار "exists" صحيح إذا كانت الرؤوس المدرجة في معامل header-names موجودة داخل الرسالة. يجب أن تكون جميع الرؤوس موجودة وإلا فإن الاختبار خطأ.
he: בדיקת „exists” (קיים) מפוענת לחיובי (true) אם הכותרות שמופיעות בארגומנט שמות הכותרות (header-names) בתוך ההודעה. כל הכותרות חייבות להיות קיימות אחרת הבדיקה שלילית (false).

source: False
ar: خطأ
he: שלילי

# @label:textbox
source: false
ar: خاطئ
he: שלילי

source: The "false" test always evaluates to false.
ar: اختبار "false" يقيم دائمًا إلى خطأ.
he: בדיקת ה־„false” (שלילי) תמיד מפוענחת ל־false.

source: Has Flag
ar: لديه إشارة
he: יש דגלון

# @label:textbox
source: Variable name (if empty it uses internal variable):
ar: اسم المتغير (إذا كان فارغاً فإنه يستخدم متغير داخلي):
he: שם המשתנה (אם ריק ייעשה שימוש במשתנה פנימי):

source: The hasflag test evaluates to true if any of the variables matches any flag name.
ar: يُقيّم اختبار hasflag إلى صواب إذا تطابق أي من المتغيرات مع أي اسم إشارة.
he: בדיקת „hasflag” (יש דגל) מפוענחת לחיובי (true) אם משתנה כלשהו מבין המשתנים תואם לשם של דגלון.

source: Header
ar: الترويسة
he: כותרת

# @label:textbox
source: With value:
ar: بالقيمة:
he: עם הערך:

source: The "header" test evaluates to true if the value of any of the named headers, ignoring leading and trailing whitespace, matches any key.
ar: يقيم اختبار "header" إلى صحيح إذا كانت قيمة أي من الرؤوس المسماة، مع تجاهل المسافات البيضاء البادئة والزائدة، تطابق أي مفتاح.
he: בדיקת „header” (כותרת) מפוענחת ל־true (אמת) אם הערך של כל אחד מהכותרות בעלות השם, תוך התעלמות מרווחים פותחים וסוגרים, מתאים לכל מפתח.

source: IHave
ar: أملك
he: יש לי

# @info:placeholder
source: Use "," to separate capabilities
ar: استخدم "," للفصل بين الإمكانيات
he: אפשר להשתמש ב־„,” כדי להפריד בין יכולות

source: The "ihave" test provides a means for Sieve scripts to test for the existence of a given extension prior to actually using it.
ar: يوفر اختبار "ihave" وسيلة لسكربتات الغربال لاختبار وجود امتداد معين قبل استخدامه فعلياً.
he: בדיקת „ihave” (יש לי) מספקת דרכים לסקריפט Sieve לבדוק אם קיימת הרחבה לפני שינסה להשתמש בה בפועל.

source: Mailbox exists
ar: صندوق البريد موجود
he: תיבת הדוא״ל קיימת

source: The "mailboxexists" test is true if all mailboxes listed in the "mailbox-names" argument exist in the mailstore, and each allows the user in whose context the Sieve script runs to "deliver" messages into it.
ar: اختبار "mailboxexists" صحيح إذا كانت جميع صناديق البريد المدرجة في معامل "mailbox-names" موجودة في مخزن البريد، وكل منها يسمح للمستخدم الذي يعمل سكربت الغربال في سياقه بـ "تسليم" الرسائل إليه.
he: בדיקת „mailboxexists” (האם קיימת תיבת דוא״ל) מפוענחת לחיובי (true) אם כל התיבות שרשומות תחת הארגומנט „mailbox-names” (שמות תיבות דוא״ל) קיימות באחסון הדוא״ל וכל אחת מהן מאפשרת למשתמש שבהקשר שלו סקריפט ה־Sieve רץ כדי להעביר („deliver”) הודעה לתוכו.

source: Meta Data
ar: بيانات تعريفية
he: נתוני על

# @label:textbox
source: Mailbox:
ar: صندوق البريد:
he: תיבת דוא״ל:

# @label:textbox
source: Annotations:
ar: الشروح:
he: פירושים:

source: This test retrieves the value of the mailbox annotation "annotation-name" for the mailbox "mailbox". The retrieved value is compared to the "key-list". The test returns true if the annotation exists and its value matches any of the keys.
ar: يسترد هذا الاختبار قيمة تعليق صندوق البريد "annotation-name" لصندوق البريد "mailbox". وتقارن القيمة المستردة بـ "قائمة المفاتيح". ويعيد الاختبار صحيحاً إذا كان التعليق موجوداً وقيمته تطابق أيًا من المفاتيح.
he: הבדיקה הזאת מושכת את הערך של פרשות תיבת הדוא״ל „annotation-name” (שם פרשנות) של תיבת הדוא״ל „mailbox”. הערך שמתקבל נבדק מול „key-list” (רשימת מפתחות. הבדיקה חיובית (true) אם הפרשנות קיימת והערך שלה מתאים למפתח כלשהו.

source: Metadata exists
ar: البيانات التعريفية موجودة
he: יש נתוני על

# @label:textbox
source: Annotation:
ar: الشرح:
he: פירוש:

source: The "metadataexists" test is true if all of the annotations listed in the "annotation-names" argument exist for the specified mailbox.
ar: اختبار "metadataexists" صحيح إذا كانت جميع التعليقات المدرجة في معامل "annotation-names" موجودة لصندوق البريد المحدد.
he: בדיקת „metadataexists” (נתוני על קיימים) מפוענחת לחיוב (true) אם כל הפרשנויות שרשומות תחת הארגומנט „annotation-names” (שמות פרשנויות) קיימות לתיבת הדוא״ל שצוינה.

source: Server Meta Data
ar: بيانات تعريفية للخادم
he: נתוני על של השרת

source: This test retrieves the value of the server annotation "annotation-name". The retrieved value is compared to the "key-list". The test returns true if the annotation exists and its value matches any of the keys.
ar: يسترد هذا الاختبار قيمة تعليق الخادم "annotation-name". تُقارَن القيمة المستردة بـ "قائمة المفاتيح". ويعيد الاختبار صحيحًا إذا كان التعليق موجودًا وقيمته تطابق أيًا من المفاتيح.
he: הבדיקה הזאת מושכת את הערך של פרשנות השרת „annotation-name” (שם פרשנות) הערך שמתקבל נבדק מול „key-list” (רשימת מפתחות. הבדיקה חיובית (true) אם הפרשנות קיימת והערך שלה מתאים למפתח כלשהו.

source: Server Meta Data Exists
ar: البيانات التعريفية للخادم موجودة
he: יש נתוני על בשרת

source: The "servermetadataexists" test is true if all of the server annotations listed in the "annotation-names" argument exist.
ar: اختبار "servermetadataexists" صحيح إذا كانت جميع تعليقات الخادم المدرجة في معامل "annotation-names" موجودة.
he: בדיקת „servermetadataexists” (קיימים נתוני על בשרת) היא חיובית אם כל פירושי השרת שמופיעים תחת הארגומנט „annotation-names” (שמות פירושים) קיימים.

source: Size
ar: الحجم
he: גודל

source: under
ar: أسفل
he: תחת

source: over
ar: فوق
he: מעל

source: The "size" test deals with the size of a message. It takes either a tagged argument of ":over" or ":under", followed by a number representing the size of the message.
ar: يتعامل اختبار "size" مع حجم الرسالة. يأخذ إما معاملاً موسومًا بـ ":over" أو ":under"، يتبعه رقم يمثل حجم الرسالة.
he: בדיקת „size” (גודל) מתמודדת עם גודל ההודעה. היא מקבלת ארגומנט מתויג כגון „‎:over” ו־„‎:under” שלאחריו מספר שמייצג את גודל ההודעה.

source: Spam Test
ar: اختبار السخام
he: בדיקת ספאם

# @option:check
source: Percent
ar: النسبة المئوية
he: אחוז

source: Sieve implementations that implement the "spamtest" test use an identifier of either "spamtest" or "spamtestplus" for use with the capability mechanism.
ar: تستخدم تطبيقات Sieve التي تنفذ اختبار "spamtest" معرفًا إما بـ "spamtest" أو "spamtestplus" للاستخدام مع آلية الإمكانية.
he: מימושים של Sieve שמממשים את בדיקת „spamtest” (בדיקת וירוסים) משתמשים במזהה של „spamtest” או של „spamtestplus” לשימוש עם מנגנון היכולות.

source: True
ar: صحيح
he: חיובי

# @label:textbox
source: true
ar: صحيح
he: חיובי

source: The "true" test always evaluates to true.
ar: اختبار "true" يقيم دائمًا إلى صحيح.
he: בדיקת ה־„true” (חיובי) תמיד מפוענחת ל־true.

source: Virus Test
ar: اختبار الفيروسات
he: בדיקת וירוסים

source: Sieve implementations that implement the "virustest" test have an identifier of "virustest" for use with the capability mechanism.
ar: تطبيقات Sieve التي تنفذ اختبار "virustest" لديها معرف "virustest" للاستخدام مع آلية الإمكانية.
he: למימושים של Sieve שמממשים את בדיקת „virustest” (בדיקת וירוסים) יש מזהה „virustest” לשימוש עם מנגנון היכולות

source: all
ar: الكلّ
he: הכול

source: localpart
ar: الجزء المحلي
he: חלק_מקומי

source: domain
ar: المجال:
he: שם_תחום

source: user
ar: المستخدم:
he: משתמש

source: detail
ar: التّفاصيل
he: פרט

source: raw
ar: خام
he: גולמי

source: content
ar: المحتوى
he: תוכן

source: text
ar: النص
he: טקסט

source: Year
ar: السنة
he: שנה

source: Month
ar: شهر
he: חודש

source: Day
ar: يوم
he: יום

source: Julian
ar: جوليان
he: יוליאני

source: Hour
ar: ساعة
he: שעה

source: Minute
ar: دقيقة
he: דקה

source: Second
ar: الثانية
he: שנייה

source: Time
ar: الوقت
he: זמן

source: iso8601
ar: آيزو8601

source: Zone
ar: المنطقة
he: אזור

source: Weekday
ar: يوم الأسبوع
he: יום בשבוע

source: Select multiple headers…
ar: اختر رؤوسًا متعددة…
he: בחירת מספר כותרות…

# @title:window
source: Headers
ar: التّرويسات
he: כותרות

# @label:textbox
source: Add new header:
ar: أضف ترويسة جديدة:
he: הוספת כותרת חדשה:

source: From
ar: من
he: מאת

source: To
ar: إلى
he: אל

source: Reply To
ar: ردّ على
he: תגובה אל

source: Cc
ar: ن‌ك
he: עותק

source: Bcc
ar: ن‌ك‌ع
he: עותק סמוי

source: Resent From
ar: أعد إرسالها من
he: נשלח מחדש דרך

source: Resent To
ar: أعد إرسالها إلى
he: נשלח מחדש אל

source: Sender
ar: المرسل
he: מוען

source: Subject
ar: الموضوع
he: נושא

source: Message Id
ar: معرّف الرّسالة
he: מזהה הודעה

source: Content type
ar: نوع المحتوى
he: סוג תוכן

source: Type
ar: النّوع
he: סוג

source: Subtype
ar: النوع الفرعي
he: תת־סוג

source: Anychild
ar: أي ابن
he: לכל צאצא

source: Parameters
ar: المعاملات
he: משתנים

source: Value
ar: القيمة
he: ערך

source: Count
ar: العدد
he: כמות

source: Greater than
ar: أكبر من
he: גדול מ־

source: Greater than or equal
ar: أكبر من أو يساوي
he: גדול או שווה ל־

source: Less than
ar: أصغر من
he: קטן מ־

source: Less than or equal
ar: أصغر من أو يساوي
he: קטן או שווה ל־

source: Equal to
ar: يساوي
he: שווה ל־

source: Not equal to
ar: لا يساوي
he: לא שווה ל־

source: Bytes
ar: بايت
he: בתים

source: KiB
ar: ك.بايت

source: MiB
ar: م.بايت

source: GiB
ar: ج.بايت

# @label:textbox
source: Please select an condition.
ar: رجاءً اختر شرط.
he: נא לבחור תנאי.

source: Sieve Script
ar: سكربت الغربال
he: סקריפט Sieve

source: Error during importing script. Do you want to switch to text mode?
ar: خطأ أثناء استيراد السكربت. هل تريد التبديل إلى وضع النص؟
he: שגיאה במהלך ייבוא סקריפט. לעבור למצב טקסט?

# @action:button
source: Switch to Text Mode
ar: انتقل إلى وضع النص
he: להחליף למצב טקסט

# @action:button
source: Do Not Switch
ar: لاتغيّر
he: לא להחליף

# @option:check
source: Add ForEveryPart loop
ar: أضِف حلقة ForEveryPart
he: הוספת לולאת ForEveryPart (לכל חלק)

source: "foreverypart", which is an iterator that walks though every MIME part of a message, including nested parts, depth first, and applies the commands in the specified block to each of them.
ar: تُعرّف "foreverypart" بأنها متكرر يمشي خلال كل جزء MIME من الرسالة، بما في ذلك الأجزاء المتداخلة، بعمق أول، ويطبق الأوامر في الكتلة المحددة على كل منها.
he: „foreverypart” (לכל חלק), שהוא מונה שעובר על כל חלק MIME של הודעה, כולל החלקים המקוננים, עם התייחסות לעומק ומחיל את הפקודות במקטע המסוים בכל אחד מהם.

source: Unknown tagValue "%1" during loading loop "for"
ar: قيمة وسم غير معروفة "%1" أثناء تحميل الحلقة "for"
he: ערך תגית (tagValue) לא ידוע „%1” במהלך טעינת לולאת „for” (לכל)

source: Unknown tag "%1" during loading loop "for"
ar: وسم غير معروف "%1" أثناء تحميل الحلقة "for"
he: תגית לא ידועה „%1” במהלך טעינת לולאת „for” (לכל)

# @label:textbox
source: Variable name:
ar: اسم المتغيّر:
he: שם משתנה:

# @option:check
source: Set value to:
ar: ضع القيمة:
he: הגדרת הערך ל־:

source: Unknown tag "%1" during loading of variables.
ar: وسم غير معروف "%1" أثناء تحميل المتغيرات.
he: תגית לא ידועה „%1” במהלך טעינת משתנים.

source: A variable has global scope in all scripts that have declared it with the "global" command. If a script uses that variable name without declaring it global, the name specifies a separate, non-global variable within that script.
ar: المتغير له نطاق عالمي في جميع السكربتات التي أعلنت عنه بالأمر "global". إذا استخدم سكربت اسم هذا المتغير دون إعلانه كعالمي، فإن الاسم يحدد متغيرًا منفصلاً وغير عالمي داخل ذلك السكربت.
he: למשתנה יש טווח מקיף בכל הסקריפטים שהכריזו עליו עם הפקודה „global”. אם סקריפט משתמש בשם משתנה מבלי להכריז עליו כמקיף (global), השם מציין משתנה נפרד, שאינו מקיף בתוך הסקריפט הזה.

source: personal
ar: شخصيّ
he: אישי

source: global
ar: عموميّ
he: מקיף

source: Unknown location type "%1" during parsing includes
ar: نوع موقع غير معروف "%1" أثناء تحليل التضمينات
he: סוג מקום שגוי „%1” במהלך פענוח ההכללות (include)

# @label:textbox
source: Include:
ar: يتضمّن:
he: כולל:

# @label:textbox
source: Name:
ar: الاسم:
he: שם:

# @option:check
source: Optional
ar: اختياري
he: רשות

# @option:check
source: Once
ar: مرّة واحدة
he: חד־פעמי

source: The "include" command takes an optional "location" parameter, an optional ":once" parameter, an optional ":optional" parameter, and a single string argument representing the name of the script to include for processing at that point.
ar: يأخذ الأمر "include" معلمة "location" اختيارية، معلمة ":once" اختيارية، معلمة ":optional" اختيارية، ومعامل سلسلة واحدة يمثل اسم السكربت المراد تضمينه للمعالجة في تلك النقطة.
he: פקודת „include” (הכללה) מקבלת את המשתנה „location” (מקום) כרשות, משתמש „‎:once” (חד־פעמי) כרשות, משתנה „‎:optional” כרשות וארגומנט מחרוזת בודדת שמייצגת את שם הסקריפט לכלול לעיבוד בנקודה הזאת.

source: We can not add more includes elements.
ar: لا يمكن إضافة المزيد من عناصر التضمين.
he: אין לנו אפשרות להוסיף עוד רכיבים להכללה (include).

source: Conditions
ar: الشروط
he: תנאים

# @option:radio
source: Match all messages
ar: طابق كلّ الرّسائل
he: ללכוד את כל ההודעות

# @option:radio
source: Match a&ll of the following
ar: طابق &جميع التالي
he: ללכוד את כל ה&באים

# @option:radio
source: Match an&y of the following
ar: طابق أ&ي من التالي
he: ללכוד &אחד מהבאים

source: Actions
ar: الإجراءات
he: פעולות

# @label:textbox
source: Add new block:
ar: أضف كتلة جديدة:
he: הוספת מקטע חדש:

source: "elsif" block
ar: كتلة "elsif"
he: מקטע „elsif” (אחרת-אם)

source: "else" block
ar: كتلة "else"
he: מקטע „else” (אחרת)

# @title:window
source: Description
ar: الوصف
he: תיאור
