Repository: KDE/libksieve
Catalog: po/*/libksieve6.po
Languages: ar, he

# Move selected filter up.
source: Up
ar: لأعلى
he: למעלה

# Move selected filter down.
source: Down
ar: لأسفل
he: למטה

# Move selected filter to the top.
source: Top
ar: للأعلى
he: עליון

# Move selected filter to the bottom.
source: Bottom
ar: للأسفل
he: תחתון

# @info:tooltip
source: New Script
ar: سكرِبت جديد
he: סקריפט חדש

# @info:tooltip
source: Delete Script
ar: احذف السّكربت
he: מחיקת סקריפט

# @info:tooltip
source: Rename Script
ar: غيّر الاسم
he: שינוי שם סקריפט

# @info:tooltip
source: Edit Script Description
ar: حرر وصف السكربت
he: עריכת תיאור סקריפט

# @action:inmenu
source: New Script
ar: برنامج نصي جديد
he: סקריפט חדש

# @action:inmenu
source: Rename Script
ar: غيّر اسم السكربت
he: שינוי שם סקריפט

# @action:inmenu
source: Edit Script Description
ar: حرر وصف السكربت
he: עריכת תיאור סקריפט

# @action:inmenu
source: Delete Script
ar: احذف السّكربت
he: מחיקת סקריפט

# @title:window
source: New Script
ar: برنامج نصي جديد
he: סקריפט חדש

source: New script name:
ar: اسم السّكربت الجديد:
he: שם לסקריפט החדש:

source: Do you want to delete "%1" script?
ar: هل تريد حذف السكربت "%1"؟
he: למחוק את הסקריפט „%1”?

# @title:window
source: Delete Script
ar: احذف السّكربت
he: מחיקת סקריפט

# @title:window
source: Rename Script
ar: أعد تسمية السكربت
he: שינוי שם סקריפט

source: New name for the script:
ar: اسم جديد للسكربت:
he: שם חדש לסקריפט:

source: forEveryPart is not supported by your server
ar: forEveryPart لا يدعمه خادمك
he: השרת שלך לא תומך ב־forEveryPart (לכל חלק)

source: Script part %1
ar: جزء السكربت %1
he: חלק סקריפט %1

source: Includes
ar: يشمل
he: כולל

source: Global Variable
ar: المتغير العام
he: משתנה מקיף

source: ForEveryPart
ar: لكل جزء
he: ForEveryPart (לכל חלק)

source: Script should always have just one "Else" block. We cannot add another one.
ar: يجب أن يحتوي السكربت دائمًا على كتلة "Else" واحدة فقط. لا يمكننا إضافة واحدة أخرى.
he: לסקריפט תמיד יכול להיות מקטע „Else” (אחרת) אחד בלבד. אין אפשרות להוסיף עוד אחד.

source: Main block
ar: الكتلة الرئيسة
he: מקטע ראשי

source: Block "Elsif"
ar: كتلة "Elsif"
he: מקטע „Elsif” (אחרת-אם)

source: Block "Else"
ar: كتلة "Else"
he: מקטע „Else” (אחרת)

# @title:window
source: Sieve Parsing Error
ar: خطأ في تحليل الغربال
he: שגיאת פענוח Sieve

source: Save As…
ar: احفظ كَ‍…
he: שמירה בשם…

source: Sieve script:
ar: سكربت الغربال:
he: סקריפט Sieve:

source: Errors reported:
ar: الأخطاء المبلغ عنها:
he: שגיאות שדווחו:

source: All Files (*)
ar: كلّ الملفّات (*)
he: כל הקבצים (*)

# @title:window
source: Save Log To File
ar: احفظ السجل في ملفّ
he: שמירת יומן לקובץ

# @action:inmenu
source: Close Tab
ar: أغلق اللسان
he: סגירת לשונית

# @title:window
source: Sieve Diagnostics
ar: تشخيص الغربال
he: אבחון Sieve

source: Collecting diagnostic information about Sieve support…
ar: اجمع معلومات التشخيص حول دعم الغربال...
he: פרטי האבחון בנוגע לתמיכת Sieve נאספים…

source: No IMAP resource found.
ar: لم يتم العثور على مورد IMAP.
he: לא נמצא משאב IMAP.

source: Unable to get the info
ar: لا يمكن الحصول على المعلومات
he: לא ניתן לקבל את הפרטים

source: Collecting data for account '%1'…
ar: اجمع البيانات للحساب '%1'…
he: נאספים פרטים לחשבון ‚%1’…

source: (Account does not support Sieve)
ar: (الحساب لا يدعم الغربال)
he: (החשבון לא תומך ב־Sieve)

source: Contents of script '%1':
ar: محتويات السكربت '%1':
he: תוכן הסקריפט ‚%1’:

source: (This script is empty)
ar: (هذا السكربت فارغ)
he: (הסקריפט הזה ריק)

source: Sieve capabilities:
ar: إمكانيات الغربال:
he: יכולות Sieve:

source: (No special capabilities available)
ar: (لا تتوفر إمكانيات خاصة)
he: (אין יכולות מיוחדות זמינות)

source: Available Sieve scripts:
ar: السكربتات المتاحة للغربال:
he: סקריפטים זמינים מסוג Sieve:

source: (No Sieve scripts available on this server)
ar: (لا تتوفر سكربتات غربال على هذا الخادم)
he: (אין סקריפטים מסוג Sieve זמינים בשרת הזה)

source: Active script: '%1'
ar: السكربت النشط: '%1'
he: סקריפט פעיל: ‚%1’

# @title:window
source: Edit Sieve Script
ar: حرر سكربت الغربال
he: עריכת סקריפט Sieve

source: Script is modified. Do you want to close editor?
ar: السكربت معدّل. هل تريد إغلاق المحرر؟
he: הסקריפט השתנה. לסגור את העורך?

# @action:button
source: Close Editor
ar: أغلق المحرّر
he: לסגור את העורך

# @action:button
source: Do Not Close
ar: لا تغلق
he: לא לסגור

source: Sieve Files (*.siv);;All Files (*)
ar: ملفّات الغربال (*.siv);;كلّ الملفّات (*)
he: קובצי Sieve‏ (‎*.siv);;כל הקבצים (*)

# @title:window
source: Save Script
ar: احفظ السكربت
he: שמירת סקריפט

source: You will overwrite script. Do you want to continue?
ar: سوف تنسخ السكربت. هل تريد المتابعة؟
he: הסקריפט יידרס. להמשיך?

# @title:window
source: Import Script
ar: استورد سكرِبت
he: ייבוא סקריפט

source: *.siv;;sieve files (*.siv);;all files (*)
ar: *.siv;;ملفات الغربال (*.siv);;جميع الملفات (*)
he: *.siv;;קובצי sieve‏ (‎*.siv);;כל הקבצים (*)

# @title:window
source: Import Script Sieve
ar: استورد سكرِبت الغربال
he: ייבוא סקריפט Sieve

source: Could not load the file %1: "%2" is the detailed error description.
ar: تعذر تحميل الملف %1: "%2" هو وصف الخطأ التفصيلي.
he: לא ניתן לטעון את הקובץ %1: „%2” היא התיאור המפורט של השגיאה.

# @title:window
source: Sieve Editor Error
ar: خطأ في الغربال
he: שגיאת עורך Sieve

# @action
source: Go to Line
ar: انتقل إلى سطر
he: מעבר לשורה

# @action
source: Comment
ar: التعليق
he: הערה

# @action
source: Uncomment
ar: أزل التّعليق
he: ביטול הערה

# @action
source: Debug Sieve Script…
ar: نقّح سكربت الغربال…
he: ניפוי שגיאות בסקריפט Sieve…

# @action
source: Wordwrap
ar: لفّ الكلمات
he: גלישת שורות

# @title:menu
source: File
ar: ملف
he: קובץ

# @title:menu
source: Edit
ar: حرّر
he: עריכה

# @title:menu
source: View
ar: اعرض
he: תצוגה

# @title:menu
source: Tools
ar: أدوات
he: כלים

# @action:inmenu
source: Close All Other Tabs
ar: أغلق كلّ الألسنة الأخرى
he: לסגור את שאר הלשוניות

# @action:inmenu
source: Close All Tabs
ar: أغلق كلّ الألسنة
he: לסגור את כל הלשוניות

source: Help
ar: مساعدة
he: עזרה

source: Error during load page about %1
ar: خطأ أثناء تحميل الصفحة حول %1
he: שגיאה בטעינת עמוד על %1

source: Help about: %1
ar: مساعدة حول: %1
he: עזרה בנושא: %1

source: Sieve Template:
ar: قالب الغربال:
he: תבנית Sieve:

source: Editor
ar: المحرّر
he: עורך

# @info:placeholder
source: Show result from "check syntax"
ar: أظهِر نتيجة "التحقق من الصيغة"
he: הצגת התוצאות של „בדיקת התחביר”

source: Error during parsing
ar: خطأ أثناء التحليل
he: שגיאה במהלך הפענוח

source: Selected text is not a full sieve script
ar: النص المحدد ليس سكربت غربال كاملاً
he: הטקסט הנבחר אינו סקריפט Sieve מלא

# @title:window
source: Parsing error
ar: خطأ تحليل
he: שגיאת פענוח

# @action
source: Check Syntax
ar: دقّق الصّياغة
he: בדיקת תחביר

source: Import…
ar: استورد…
he: ייבוא…

# @action
source: Create Rules Graphically…
ar: أنشئ القواعد رسوميًّا…
he: יצירת כללים באופן חזותי…

source: Share…
ar: شارِك…
he: שיתוף…

# @action
source: Server Info
ar: معلومات الخادم
he: פרטי שרת

# @label:textbox
source: Script name:
ar: اسم السّكربت:
he: שם הסקריפט:

source: Simple Mode
ar: النمط البسيط
he: מצב פשוט

source: Advanced Mode
ar: الوضع المتقدم
he: מצב מתקדם

# @title:window
source: Sieve Server Support
ar: دعم خادم الغربال
he: תמיכה בשרת ה־Sieve

source: Sieve server supports:
ar: يتيح خادم الغربال:
he: שרת ה־Sieve תומך באלה:

# @action
source: Quick Ask
ar: سؤال سريع
he: שאלה מהירה

# @action
source: Insert Rule
ar: أدرج قاعدة
he: הוספת כלל

# @action
source: Help about: '%1'
ar: مساعدة حول: '%1'
he: עזרה בנוגע: ‚%1’

# @action
source: Edit Rule
ar: حرر القاعدة
he: עריכת כלל

source: Some errors were found during parsing. <a href="sieveerrordetails">(Details…)</a>
ar: وجدَت بعض الأخطاء أثناء التحليل. <a href="sieveerrordetails">(التفاصيل…)</a>
he: נמצאו כל מיני שגיאות במהלך הפענוח. <a href="sieveerrordetails">(פרטים…)</a>

# @action
source: Switch to Graphical Mode
ar: انتقل إلى الوضع الرسومي
he: להחליף למצב גרפי

# @action
source: Stay in Text Mode
ar: ابقَ في وضع النص
he: להישאר במצב טקסט

# @action
source: Switch to Text Mode
ar: انتقل إلى وضع النص
he: להחליף למצב טקסט

# @action
source: Stay in Graphical Mode
ar: ابقَ في الوضع الرسومي
he: להישאר במצב גרפי

source: We cannot parse script. We cannot switch to graphical mode
ar: لا يمكننا تحليل السكربت. لا يمكننا الانتقال إلى الوضع الرسومي
he: אי אפשר לפענח את הסקריפט. לא ניתן לעבור למצב גרפי

# @info:tooltip
source: Close
ar: أغلق
he: סגירה

source: Close
ar: أغلق
he: סגירה

# Find text
source: F&ind:
ar: ا&عثر:
he: &איתור:

# @info:tooltip
source: Text to search for
ar: النّصّ للبحث عنه
he: טקסט לחיפוש

# Find and go to the next search match
source: Next
ar: التالي
he: הבאה

# @info:tooltip
source: Jump to next match
ar: انتقل إلى المطابقة التّالية
he: דילוג לתוצאה הבאה

# Find and go to the previous search match
source: Previous
ar: السّابقة
he: הקודמת

# @info:tooltip
source: Jump to previous match
ar: انتقل إلى المطابقة السّابقة
he: דילוג לתוצאה הקודמת

source: Options
ar: خيارات
he: אפשרויות

# @info:tooltip
source: Modify search behavior
ar: عدل سلوك البحث
he: שינוי התנהגות החיפוש

source: Case sensitive
ar: حسّاس لحالة الأحرف
he: תלוי רישיות

source: Phrase not found
ar: لم توجد العبارة
he: הביטוי לא נמצא

# @title:window
source: Save Web Page
ar: احفظ صفحة الويب
he: שמירת עמוד אתר

# @title:window
source: Manage Sieve Scripts
ar: إدارة سكربتات الغربال
he: ניהול סקריפטים של Sieve

# create a new sieve script
source: New…
ar: جديد…
he: חדש…

# @action:button
source: Edit…
ar: حرّر…
he: עריכה…

# @action:button
source: Delete
ar: احذف
he: מחיקה

# @action:button
source: Deactivate
ar: تعطيل
he: השבתה

# @title:window
source: Sieve Error
ar: خطأ في الغربال
he: שגיאת Sieve

source: Uploading script to server for checking it, please wait…
ar: يرفع سكربتًا إلى الخادم لفحص، رجاءً انتظر…
he: הסקריפט נשלח לשרת לבדיקה, נא להמתין…

source: The Sieve script was successfully uploaded.
ar: رُفع سكربت الغربال بنجاح.
he: סקריפט ה־Sieve הועלה בהצלחה.

# @title:window
source: Sieve Script Upload
ar: رفع سكربت الغربال
he: העלאת סקריפט Sieve

source: Uploading the Sieve script failed. The server responded: %1
ar: فشل رفع سكربت الغربال. ردّ الخادم بِ‍: %1
he: העלאת סקריפט ה־Sieve נכשלה. תגובת השרת: %1

# @title:window
source: Sieve Parsing
ar: تحليل الغربال
he: פענוח Sieve

source: XML Files (*.xml);;All Files (*)
ar: ملفات XML (*.xml);;كافة الملفات (*)
he: קובצי XML‏ (‎*.xml);;כל הקבצים (*)

# @title:window
source: Debug Sieve Script
ar: نقّح سكربت الغربال...
he: ניפוי שגיאות בסקריפט Sieve

source: Apply Changes
ar: طبّق التغييرات
he: החלת שינויים

# @action:button
source: Debug
ar: نقّح
he: ניפוי שגיאות

source: Debug
ar: التنقيح
he: ניפוי שגיאות

# @label:textbox
source: Email path:
ar: مسار البريد الإلكتروني:
he: נתיב דוא״ל:

# @label:textbox
source: Extension:
ar: الامتداد:
he: הרחבה:

# @info:placeholder
source: Activate extension with "+<name of extension>", deactivate it with "-<name of extension>"
ar: تنشيط الامتداد باستخدام "<name of extension>"، إلغاء تنشيطه باستخدام "-<name of extension>"
he: אפשר להפעיל הרחבה בעזרת „+<שם ההרחבה>”, או לכבות עם „-<שם ההרחבה>”

# @info:placeholder
source: Display check script result…
ar: اعرض نتيجة التحقق من السكربت…
he: הצגת תוצאת בדיקת הסקריפט…

source: Script text is empty.
ar: نص السكربت فارغ.
he: טקסט הסקריפט ריק.

source: Email file must be installed locally.
ar: يجب تثبيت ملف البريد الإلكتروني محلياً.
he: קובץ הדוא״ל חייב להיות מותקן מקומית.

source: Failed to open temporary file.
ar: فشل فتح الملف المؤقت.
he: פתיחת הקובץ הזמני נכשלה.

source: Script still contains debug method. Remove it please.
ar: السكربت لا يزال يحتوي على طريقة تصحيح. رجاءً، أزلها.
he: הסקריפט עדיין מכיל מתודת ניפוי שגיאות. נא להסיר אותה.

# @action
source: Clear
ar: امحُ
he: פינוי

source: Text Files (*.txt);;All Files (*)
ar: الملفّات النّصّيّة (*.txt);;كلّ الملفّات (*)
he: קובצי טקסט (‎*.txt);;כל הקבצים (*)

# @action
source: Add debug here
ar: أضف نقح هنا
he: יש להוסיף ניפוי שגיאות לכאן

# @label:textbox
source: "sieve-test" was not found on system. Please install it. (See in Dovecot package)
ar: لم يعثر على "sieve-test" على النظام. رجاءً، ثبته. (انظر في حزمة Dovecot)
he: ‏„sieve-test” לא נמצא במערכת. נא להתקין אותו. (ר׳ חבילת Dovecot)

source: Filter on Mailing List-ID
ar: مرشح على معرف قائمة التوزيع
he: סינון לפי מזהה רשימת דיוור (MailingList-ID)

source: Filter on Subject
ar: رشّح حسب المو&ضوع...
he: סינון לפי נושא

source: Filter on Spamassassin
ar: مرشح على سبامأساسين
he: סינון לפי Spamassassin

source: Flag messages
ar: رسائل الإشارة
he: סימון הודעות

source: Forward Message
ar: تمرير الرسالة
he: העברת הודעה

source: Forward Message and add copy
ar: أعد توجيه الرسالة وأضِف نسخة
he: העברת הודעה והוספת עותק

source: Destroy mail posted by…
ar: دمر البريد الذي أرسله…
he: השמדת הודעה שפורסמה על ידי…

source: Vacations
ar: الإجازات
he: חופשות

# @title:window
source: Default template
ar: القالب المبدئيّ
he: תבנית ברירת מחדל

# @title:window
source: Template
ar: القالب
he: תבנית

source: You can drag and drop element on editor to import template
ar: يمكنك سحب العناصر وإفلاتها في المحرّر لاستيراد القوالب
he: אפשר לגרור רכיב לעורך כדי לייבא תבנית

# @title:window
source: Configure "Out of Office" Replies
ar: ضبط ردود "خارج المكتب".
he: הגדרת תגובות „מחוץ למשרד”

# @info
source: Do you really want to cancel?
ar: أمتأكّد من الإلغاء؟
he: לבטל?

# @title:window
source: Confirmation
ar: تأكيد
he: אישור

# @action:button
source: Cancel Editing
ar: ألغ التحرير
he: לבטל עריכה

# @action:button
source: Do Not Cancel
ar: لا تلغ
he: לא לבטל

# @label:textbox
source: KMail's Out of Office Reply functionality relies on server-side filtering. You have not yet configured an IMAP server for this. You can do this on the "Filtering" tab of the IMAP account configuration.
ar: تعتمد وظيفة الردود خارج المكتب في KMail على التصفية من جانب الخادم. لم تضبط بعد خادم IMAP لهذا الغرض. يمكنك القيام بذلك في تبويب "التصفية" في إعدادات حساب IMAP.
he: יכולת תגובת „מחוץ למשרד” של KMail מסתמכת על סינון מצד השרת. לא הגדרת עדיין שרת IMAP לשם כך. אפשר לעשות זאת בלשונית „סינון” של הגדרות חשבון ה־IMAP.

# @label:textbox
source: Configure vacation notifications to be sent:
ar: أعد إعداد إشعارات الإجازة ليتم إرسالها:
he: הגדרת התראות חופשה לשליחה:

# @option:check
source: &Activate vacation notifications
ar: &نشط إشعارات الإجازة
he: הפעלת ה&תראות חופשה

# @label:textbox
source: &Subject of the vacation mail:
ar: &موضوع بريد الإجازة:
he: &נושא הודעת החופשה:

# @label:textbox
source: Start date:
ar: تاريخ البدء:
he: תאריך התחלה:

# @label:textbox
source: End date:
ar: تاريخ النهاية:
he: תאריך סיום:

source: day
ar: (أقلّ من يوم)
he: יום

# @label:textbox
source: &Resend notification only after:
ar: أ&عد إرسال الإشعار فقط بعد:
he: לשלוח את ההתראה שוב רק ל&אחר:

# @label:textbox
source: &Send responses for these addresses:
ar: أ&رسل الردود لهذه العناوين:
he: ל&שלוח תגובות לכתובות האלה:

# @label:textbox
source: &Action for incoming mails:
ar: إ&جراء للبريد الوارد:
he: &פעולה להודעות דוא״ל נכנסות:

# @option:check
source: Do not send vacation replies to spam messages
ar: لا ترسل ردود الإجازة لرسائل البريد المزعج
he: לא לשלוח תגובות לחופשה להודעות ספאם

# @option:check
source: Only react to mail coming from domain:
ar: تفاعل فقط مع البريد القادم من النطاق:
he: להגיב רק לדוא״ל שמגיע משם תחום מסוים:

source: There is still an active out-of-office reply configured. Do you want to edit it?
ar: لا يزال هناك رد خارج المكتب نشط. هل تريد تعديله؟
he: יש עדיין תגובת מחוץ למשרד פעילה ומוגדרת. לערוך אותה?

# @title:window
source: Out-of-office reply still active
ar: الرد خارج المكتب لا يزال نشطاً
he: תגובת מחוץ למשרד עדיין פעילה

# @action:button
source: Edit
ar: حرّر
he: עריכה

# @action:button
source: Ignore
ar: تجاهل
he: התעלמות

# @label:textbox
source: Your server did not list "vacation" in its list of supported Sieve extensions;without it, KMail cannot install out-of-office replies for you.Please contact your system administrator.
ar: خادمك لم يدرج "vacation" في قائمة امتدادات الغربال المدعومة؛ بدونه، لا يمكن لـ KMail أن يثبت لك ردود خارج المكتب. رجاءً، اتصل بمسؤول نظامك.
he: השרת שלך לא החזיר „חופשה” (vacation) כחלק מרשימת הרחבות ה־Sieve הנתמכות, בלעדיה, KMail לא יכול להתקין תגובות מחוץ למשרד עבורך. נא ליצור קשר עם הנהלת המערכת שלך.

source: Someone (probably you) changed the vacation script on the server. KMail is no longer able to determine the parameters for the autoreplies. Default values will be used.
ar: شخص ما (ربما أنت) غير سكربت الإجازة على الخادم. لم يعد بإمكان KMail تحديد معاملات الردود التلقائية. سوف تستخدم القيم الافتراضية.
he: גורם כלשהו (כנראה את או אתה) שינה את סקריפט החופשה בשרת. KMail לא יוכל עוד לקבוע את המשתנים לתגובות האוטומטיות. ייעשה שימוש בערכי ברירת המחדל.

source: No Sieve URL configured
ar: لم يُضبط مسار الغربال
he: לא מוגדרת כתובת Sieve

source: No IMAP server configured…
ar: لم يُضبط خادم IMAP…
he: לא הוגדר שרת IMAP…

source: Available Scripts
ar: السكربتات المتاحة
he: סקריפטים זמינים

source: Network down.
ar: الشبكة معطلة.
he: הרשת מנותקת.

source: Edit Script…
ar: حرّر السّكربت…
he: עריכת סקריפט…

source: Rename Script…
ar: غيّر الاسم…
he: שינוי שם סקריפט…

source: Delete Script
ar: احذف السّكربت
he: מחיקת סקריפט

source: Deactivate Script
ar: ألغِ تفعيل السّكربت
he: השבתת סקריפט

source: New Script…
ar: سكرِبت جديد…
he: סקריפט חדש…

source: New Sieve Script
ar: سكربت غربال جديد
he: סקריפט Sieve חדש

source: Please enter a name for the new Sieve script:
ar: رجاءً أدخِل اسماً للسكربت الجديد للغربال:
he: נא למלא את השם של סקריפט ה־Sieve החדש:

source: unnamed
ar: غير مسمّى
he: ללא שם

source: Empty name is not a valid name
ar: الاسم الفارغ ليس اسماً صالحاً
he: שם ריק אינו שם תקני

source: You cannot use protected name.
ar: لا يمكنك استخدام اسم محمي.
he: אי אפשר להשתמש בשם מוגן.

source: Script name already used "%1".
ar: اسم السكربت "%1" مستخدم بالفعل.
he: כבר נעשה שימוש בשם „%1” לסקריפט כלשהו.

source: Rename Script
ar: أعد تسمية السكربت
he: שינוי שם סקריפט

source: Script Name:
ar: اسم السّكربت:
he: שם הסקריפט:

source: Really delete script "%1" from the server?
ar: هل تريد حقاً حذف السكربت "%1" من الخادم؟
he: למחוק את הסקריפט „%1” מהשרת?

# @title:window
source: Delete Sieve Script Confirmation
ar: تأكيد حذف سكربت الغربال
he: אישור מחיקת סקריפט Sieve

source: Deleting the script failed. The server responded: %1
ar: فشل حذف السكربت. استجاب الخادم: %1
he: מחיקת הסקריפט נכשלה. תגובת השרת: %1

source: Failed to fetch the list of scripts
ar: فشل جلب قائمة السكربتات
he: משיכת רשימת הסקריפטים נכשלה

# @info:placeholder
source: Define Folder
ar: عرّف مجلّدًا
he: הגדרת תיקייה

source: E-Reject
he: דחייה מורחבת (E-Reject)
